Terraform plan for __production__
<details>
  <summary>Plan: 13 to add, 12 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_iam_user_policy_attachment.eks-admin-policy will be created
  + resource "aws_iam_user_policy_attachment" "eks-admin-policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + user       = "ssb-eks-broker"
    }

  # aws_iam_user_policy_attachment.eks-broker-policy will be created
  + resource "aws_iam_user_policy_attachment" "eks-broker-policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + user       = "ssb-eks-broker"
    }

  # aws_iam_user_policy_attachment.smtp-admin-policy will be created
  + resource "aws_iam_user_policy_attachment" "smtp-admin-policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + user       = "ssb-smtp-broker"
    }

  # aws_iam_user_policy_attachment.smtp-broker-policy will be created
  + resource "aws_iam_user_policy_attachment" "smtp-broker-policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + user       = "ssb-smtp-broker"
    }

  # module.broker_eks.cloudfoundry_app.ssb will be updated in-place
  ~ resource "cloudfoundry_app" "ssb" {
      ~ environment          = (sensitive value)
        id                   = "aa6d97a8-88d6-4f88-a769-c1fd125cd50c"
      ~ id_bg                = "************************************" -> (known after apply)
        name                 = "ssb-eks"
        # (16 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.broker_eks.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/management"] will be updated in-place
  ~ resource "cloudfoundry_service_broker" "space_scoped_broker" {
        id                               = "a0a3aed6-3930-4a2b-839e-1eaf93e4eb56"
        name                             = "ssb-eks-gsa-datagov-management"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ password                         = (sensitive value)
        # (8 unchanged attributes hidden)
    }

  # module.broker_eks.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/prod"] will be updated in-place
  ~ resource "cloudfoundry_service_broker" "space_scoped_broker" {
        id                               = "f551b0db-09e4-4b55-8358-e0385b0c2bf6"
        name                             = "ssb-eks-gsa-datagov-prod"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ password                         = (sensitive value)
        # (8 unchanged attributes hidden)
    }

  # module.broker_eks.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/staging"] will be updated in-place
  ~ resource "cloudfoundry_service_broker" "space_scoped_broker" {
        id                               = "e2dad6fb-53ec-461f-a1f0-a707d6b790b9"
        name                             = "ssb-eks-gsa-datagov-staging"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ password                         = (sensitive value)
        # (8 unchanged attributes hidden)
    }

  # module.broker_smtp.cloudfoundry_app.ssb will be updated in-place
  ~ resource "cloudfoundry_app" "ssb" {
      ~ environment          = (sensitive value)
        id                   = "4d9b5a5f-8bce-48f3-a971-0f5cd6b692ec"
      ~ id_bg                = "************************************" -> (known after apply)
        name                 = "ssb-smtp"
        # (16 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.broker_smtp.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/management"] will be updated in-place
  ~ resource "cloudfoundry_service_broker" "space_scoped_broker" {
        id                               = "c7ca5abc-fc85-434c-ac70-5a87406f4939"
        name                             = "ssb-smtp-gsa-datagov-management"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ password                         = (sensitive value)
        # (8 unchanged attributes hidden)
    }

  # module.broker_smtp.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/prod"] will be updated in-place
  ~ resource "cloudfoundry_service_broker" "space_scoped_broker" {
        id                               = "f18525a2-fdf5-47af-b117-887f36bf2253"
        name                             = "ssb-smtp-gsa-datagov-prod"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ password                         = (sensitive value)
        # (8 unchanged attributes hidden)
    }

  # module.broker_smtp.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/staging"] will be updated in-place
  ~ resource "cloudfoundry_service_broker" "space_scoped_broker" {
        id                               = "b6b2f72b-217d-4a60-bcf7-6b93e90a482d"
        name                             = "ssb-smtp-gsa-datagov-staging"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ password                         = (sensitive value)
        # (8 unchanged attributes hidden)
    }

  # module.broker_solr.cloudfoundry_app.ssb will be updated in-place
  ~ resource "cloudfoundry_app" "ssb" {
      + docker_image               = ""
      ~ environment                = (sensitive value)
      + health_check_http_endpoint = ""
        id                         = "ffd7e5ee-7a63-47d2-901e-084a15dbae49"
        name                       = "ssb-solr"
        # (17 unchanged attributes hidden)


        # (3 unchanged blocks hidden)
    }

  # module.broker_solr.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/management"] will be updated in-place
  ~ resource "cloudfoundry_service_broker" "space_scoped_broker" {
        id                               = "b8e75df9-8bea-4b61-bdbd-f0e4a6691364"
        name                             = "ssb-solr-gsa-datagov-management"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ password                         = (sensitive value)
        # (8 unchanged attributes hidden)
    }

  # module.broker_solr.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/prod"] will be updated in-place
  ~ resource "cloudfoundry_service_broker" "space_scoped_broker" {
        id                               = "7331319a-f9c6-4c1f-98b4-83037570d14f"
        name                             = "ssb-solr-gsa-datagov-prod"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ password                         = (sensitive value)
        # (8 unchanged attributes hidden)
    }

  # module.broker_solr.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/staging"] will be updated in-place
  ~ resource "cloudfoundry_service_broker" "space_scoped_broker" {
        id                               = "bab70af0-84b0-47b2-8de3-3e24260a6dd0"
        name                             = "ssb-solr-gsa-datagov-staging"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ password                         = (sensitive value)
        # (8 unchanged attributes hidden)
    }

  # module.iam_assumable_roles.aws_iam_role.admin[0] will be created
  + resource "aws_iam_role" "admin" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + Bool            = {
                              + aws:MultiFactorAuthPresent = [
                                  + "true",
                                ]
                            }
                          + NumericLessThan = {
                              + aws:MultiFactorAuthAge = [
                                  + "86400",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS     = "arn:aws:iam::133032889584:root"
                          + Service = []
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "SSBAdmin"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.iam_assumable_roles.aws_iam_role.poweruser[0] will be created
  + resource "aws_iam_role" "poweruser" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + Bool            = {
                              + aws:MultiFactorAuthPresent = [
                                  + "true",
                                ]
                            }
                          + NumericLessThan = {
                              + aws:MultiFactorAuthAge = [
                                  + "86400",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS     = "arn:aws:iam::133032889584:root"
                          + Service = []
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "SSBDev"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.iam_assumable_roles.aws_iam_role_policy_attachment.admin[0] will be created
  + resource "aws_iam_role_policy_attachment" "admin" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "SSBAdmin"
    }

  # module.iam_assumable_roles.aws_iam_role_policy_attachment.poweruser[0] will be created
  + resource "aws_iam_role_policy_attachment" "poweruser" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/PowerUserAccess"
      + role       = "SSBDev"
    }

  # module.smtp_broker_policy.aws_iam_policy.policy will be created
  + resource "aws_iam_policy" "policy" {
      + arn         = (known after apply)
      + description = "SMTP broker policy (covers SES, Route53, etc)"
      + id          = (known after apply)
      + name        = "smtp_broker"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ses:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.ssb-eks-broker-user.aws_iam_access_key.this_no_pgp[0] will be created
  + resource "aws_iam_access_key" "this_no_pgp" {
      + create_date                    = (known after apply)
      + encrypted_secret               = (known after apply)
      + encrypted_ses_smtp_password_v4 = (known after apply)
      + id                             = (known after apply)
      + key_fingerprint                = (known after apply)
      + secret                         = (sensitive value)
      + ses_smtp_password_v4           = (sensitive value)
      + status                         = "Active"
      + user                           = "ssb-eks-broker"
    }

  # module.ssb-eks-broker-user.aws_iam_user.this[0] will be created
  + resource "aws_iam_user" "this" {
      + arn           = (known after apply)
      + force_destroy = true
      + id            = (known after apply)
      + name          = "ssb-eks-broker"
      + path          = "/"
      + tags_all      = (known after apply)
      + unique_id     = (known after apply)
    }

  # module.ssb-smtp-broker-user.aws_iam_access_key.this_no_pgp[0] will be created
  + resource "aws_iam_access_key" "this_no_pgp" {
      + create_date                    = (known after apply)
      + encrypted_secret               = (known after apply)
      + encrypted_ses_smtp_password_v4 = (known after apply)
      + id                             = (known after apply)
      + key_fingerprint                = (known after apply)
      + secret                         = (sensitive value)
      + ses_smtp_password_v4           = (sensitive value)
      + status                         = "Active"
      + user                           = "ssb-smtp-broker"
    }

  # module.ssb-smtp-broker-user.aws_iam_user.this[0] will be created
  + resource "aws_iam_user" "this" {
      + arn           = (known after apply)
      + force_destroy = true
      + id            = (known after apply)
      + name          = "ssb-smtp-broker"
      + path          = "/"
      + tags_all      = (known after apply)
      + unique_id     = (known after apply)
    }

Plan: 13 to add, 12 to change, 0 to destroy.
```
</details>

Plan generated in [plan #107](https://github.com/GSA/datagov-ssb/actions/runs/1106599508)